[
  {
    "title": "Fire Pre-Plan Vizualizer/Collector",
    "type": "Web-Application",
    "imageSrc": "images/Bruhn_Preplan.png",
    "altText": "Fire Pre-Plan Vizualizer",
    "buttons": [
      {
        "btnName": "Demo",
        "link": "https://youtu.be/RhL3ZzYVeO4 ",
        "action": "target='_blank'"
      },
      {
        "btnName": "App",
        "link": "https://tjbruhn.github.io/wiscpracticum-preplan/",
        "action": "target='_blank'"
      },
      {
        "btnName": "GitHub",
        "link": "https://github.com/TjBruhn/wiscpracticum-preplan",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>Fire departments are exploring technologies to improve the collection and use of pre-plans. Pre-plans are an excellent opportunity for mobile geospatial technologies. The ability to serve interactive data and imagery from an interactive web-map is a large advantage over the static pre-plan documents widely used.</p><p>This project is a web-based pre-plan application that allows firefighters to view, add, and edit data in a common interface during collection and use in an incident. The application enables data collection with minimal training, makes collected data immediately available in the pre-plan format, and connects images with their associated attributes. Users can explore the surrounding context of a facility, quickly view pre-plans of neighboring structures, or enlarge images for closer inspection. The app is built specifically for iPad, but responsive across a range of devices. It was built using HTML, CSS, and JavaScript with jQuery and the ArcGIS JavaScript SDK.</p><p>Developed for Geography 778 Practicum and Pleasant Hill Goshen Fire District.</p>"
  },
  {
    "title": "Emergency Services Levy",
    "type": "StoryMap",
    "imageSrc": "images/Bruhn_StorymapLevy.png",
    "altText": "Opening page of story map",
    "buttons": [
      {
        "btnName": "Demo",
        "link": "https://youtu.be/edf9qtTDEUw",
        "action": "target='_blank'"
      },
      {
        "btnName": "StoryMap",
        "link": "https://storymaps.arcgis.com/stories/4382c614d90d4d7c8159ccb213f7529b",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>This ArcGIS StoryMap was created for Clackamas Fire District to provide background for a proposed levy. I created the StoryMap layout and theme, all the embedded maps, and the animation. This project was a collaborative effort. I wrote much of the content to establish the story flow and then worked with CFD to refine and adapt the content to match their intent more fully. I really enjoyed the collaborative process. </p><p>I really enjoy partnering with organizations to extend their capacity through my technical expertise. This project is a great example of how these partnerships can produce great results. CFD staff are experts in their domain — fire and EMS. They don't need to be experts in GIS. Combining our expertise allows CFD to maintain their focus on having the best fire and EMS experts engaged in their day-to-day challenges while also having GIS expertise at hand when they need it. </p>"
  },
  {
    "title": "Amazon Park Community Experience",
    "type": "Web-Application",
    "imageSrc": "images/Bruhn_AmazonCE.png",
    "altText": "Amazon Park Community Experience screen shot",
    "buttons": [
      {
        "btnName": "Demo",
        "link": "https://youtu.be/PLiMABJzMSY",
        "action": "target='_blank'"
      },
      {
        "btnName": "GitHub",
        "link": "https://github.com/TjBruhn/amazon-park-map",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>I use Amazon Park nearly every day. I walk, fly UAS, play frisbee, attend classes at the community center, run on trails, rollerblade on paths, watch birds, and listen to frogs. This park is a large part of my life in Eugene and as I watch others, I see it has similar importance to their lives. In the weeks leading up to my Geography 777 final project, I would walk in Amazon and think about which park I wanted to base my app on. One day it struck me that the park I was in was the perfect choice for my project.</p><p>Eugene has a lot of parks and natural areas. Unfortunately, the city struggles to maintain all of them. It is common knowledge that the tax structure in Oregon has left municipalities too lean. I started to imagine that one way to boost the funding for Eugene parks would be through some grant opportunity. Grant applications are stronger when there is a solid human impact narrative. I came up with the idea to create an app that would allow citizens to share how they use the park and why they love it. I wanted a simple app that could be focused on the park users and their experiences in the park.</p><p>In today's development world, you cannot talk about interactivity in web applications without hearing “React”. With user interactivity in mind, I decided to take advantage of React as the front-end framework. For the back-end, I chose to use ESRI's ArcGIS JavaScript SDK (SDK) with data housed in ArcGIS online (AGOL). All the source data for Amazon was available from the city through AGOL. I also knew that the app would need to store images and AGOL feature layer attachments provide a convenient image server solution. Imagining the city as the client for this application combined with the image solution made AGOL logical choice.</p>"
  },
  {
    "title": "Nitrate Cancer Analysis",
    "type": "GIS Analysis/Python GUI",
    "imageSrc": "images/Bruhn_nitrateCancerGui.png",
    "altText": "Holiday Farm Fire Recovery Explorer",
    "buttons": [
      {
        "btnName": "Demo",
        "link": "https://youtu.be/pioDA-LW4R8",
        "action": "target='_blank'"
      },
      {
        "btnName": "GitHub",
        "link": "https://github.com/TjBruhn/nitrate-cancer-gui",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>This application provides users a simple Graphical User Interface for exploring the relationship between Cancer rates and Nitrate levels in water across Wisconsin. This application was developed for Geography 777 project #1.</p><p>This project imagined an analysis scenario in which the Wisconsin Department of Natural Resources (WDNR) was interested in investigating the relationship between the nitrate levels in water around the state and the occurrence of cancer. The deliverables included an interactive tool that would allow WDNR users to adjust the distance decay parameter used in the analysis and return a residuals map.</p><p>This project was accomplished with a combination of ArcGIS Pro (ArcPro), ArcPy, and the Python Tkinter GUI library with the CustomTkinter library—for a more modern look and feel. I set the project up in ArcPro where I built the various map layouts and worked out the geoprocessing model. I converted the geoprocessing model into a python script. I wrote a second script to export layouts from ArcPro after geoprocessing. Then I created the GUI application using Tkinter/CustomTkinter to get a modern app. The app allows the user to set the geoprocessing parameters, runs the various scripts, and displays a map with the results. </p><p>I spent a lot of time on the UI/UX on this project and am pleased with how it turned out. I think I will allow my instructors grading comments to close this one out: </p><p><em>“Excellent work Trever! I rarely give out 100%'s and this is one of the best python apps for project 1 to date. You've gone above and beyond in multiple aspects. The app's layout is nicely balanced — packed with content but doesn't feel overcrowded. You've certainly created the app with the user in mind from the about information to the feedback on input and running of the app. The output maps are styled well and include more than the necessary map elements.”</em></p>"
  },
  {
    "title": "Holiday Farm Fire Recovery Explorer",
    "type": "Web-Application",
    "imageSrc": "images/Holidayfarm.png",
    "altText": "Holiday Farm Fire Recovery Explorer",
    "buttons": [
      {
        "btnName": "Demo",
        "link": "https://youtu.be/cVvt3HIskJA",
        "action": "target='_blank'"
      },
      {
        "btnName": "App",
        "link": "https://tjbruhn.github.io/holidayfarm_leaflet/",
        "action": "target='_blank'"
      },
      {
        "btnName": "GitHub",
        "link": "https://github.com/TjBruhn/holidayfarm_leaflet",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>The summer of 2020 was unique in western Oregon. Until Labor Day weekend, the summer and fire season had been mild. Labor Day weekend was hot and dry. Strong winds the night of Monday, September 7th took a mild fire season and turned it into one of the most destructive fire seasons in Oregon's history. Across the state several major fires erupted, and driven by high winds, consumed entire communities in a matter of hours. In the wake of these fires, City and County planning departments have been overwhelmed in their efforts to manage rebuilding. </p><p>The Holiday Farm Fire began just outside of the Holiday Farm RV Park in the McKenzie River valley. Uncharacteristic down-canyon winds roared, driving the fire miles in minutes. Two towns were burned to foundations and the evacuation was harrowing. The fires burned for only a short time, but the destruction was extensive. Shortly after the fire the cleanup began, and along with it talk of rebuilding. </p><p>Lane County launched a long-term recovery task force and hired a permit navigator dedicated to the recovery and rebuild after the Holiday Farm Fire. Lane County's GIS team created data layers and a basic webmap that allows these staff and the public to monitor the rebuild progress. </p><p>This application tapped into these publicly available data and created an interactive dashboard. The dashboard displays summary statistics for the extent in the viewport. Users may access information about a given parcel's, rebuild progress, sale status, and original damage assessment. </p><p>I built this one for Geography 575, Interactive Cartography but shared it with the folks on the long-term recovery task force for their use in helping this community recover. The dashboard was built using Esri Leaflet, JavaScript, and CSS.</p>"
  },
  {
    "title": "Precipitation in Oregon",
    "type": "Interactive Webmap",
    "imageSrc": "images/precip.png",
    "altText": "Preciptation in Oregon map",
    "buttons": [
      {
        "btnName": "App",
        "link": "https://tjbruhn.github.io/treverbruhn_leaflet_lab/",
        "action": "target='_blank'"
      },
      {
        "btnName": "GitHub",
        "link": "https://github.com/TjBruhn/treverbruhn_leaflet_lab",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>Having moved relatively recently to Oregon I was trying to wrap my head around what was normal precipitation — or in other words, when will it stop raining? What better way to understand what was normal than to build an app to look at the precipitation data from one year to the next?</p><p>This app allows users to explore precipitation in Oregon over time. This was the first project in Geography 575, Interactive Cartography. The project goal was to create a web-based spatiotemporal visualization that 'makes visible' some regional geographic phenomenon and process. We were learning about user interaction and data visualization with proportional symbols. At the same time, we were learning to program in JavaScript.</p><p>This is my first JavaScript project. As first web projects go, I think it turned out pretty well. I had fun with the SVG raindrop in the legend and creating the silly raindrop background in Adobe Illustrator.</p>"
  },
  {
    "title": "Metric Tons of CO2 Emissions",
    "type": "Interactive Webmap",
    "imageSrc": "images/C02Emissions.png",
    "altText": "C02 Emissions map",
    "buttons": [
      {
        "btnName": "App",
        "link": "https://tjbruhn.github.io/tjbruhn-d3-coordinated-viz/",
        "action": "target='_blank'"
      },
      {
        "btnName": "GitHub",
        "link": "https://github.com/TjBruhn/tjbruhn-d3-coordinated-viz",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>This app gives users the opportunity to explore C02 emissions by state and source. It is a highly animated application that coordinates the user interaction between the map and chart. Users always know if they are over something interactive because everything moves. Okay so it's not very subtle, and arguably over wrought, but as an exercise in what is possible for providing interactive feedback it was a really good experience. </p><p>This was the second project in Geography 575, Interactive Cartography. The project goal was to design a highly interactive and coordinated geovisualization application. We were deep into UI/UX design theory and learning how to create interactive elements in web projects. We dove into the D3 library to learn data visualization and mapping with SVGs.</p><p>I had a lot of fun with this one. I am particularly proud of the bivariate symbology. Visit the app and click “Overlay Population” and enjoy the transformation.</p>"
  },
  {
    "title": "2019 Top 10 Most Deadly",
    "type": "Infographic",
    "imageSrc": "images/TreverBruhn_infographic_Thmb.jpg",
    "altText": "Infographic, most common causes of death 2019",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/TreverBruhn_infographic.pdf",
        "action": "target='_blank'"
      },
      {
        "btnName": "Get png",
        "link": "lib/Bruhn_infographic.png",
        "action": "download='infographic'"
      }
    ],
    "description": "<p><strong>Trigger warning:</strong> This project deals with common causes of death in a dark humorous manner. These causes of death are serious and cause a lot of pain, suffering, and grief. This project does not intend to diminish the seriousness or the grief of those affected by these diseases. The intention is to use humor as a means of coping with the fear of death that became so prevalent with the Covid-19 pandemic. If you cope through comedy, take a look, otherwise feel free to skip this one.</p><p>Our challenge was to design an infographic that included bivariate maps. The topic was ours to choose. At the time I was having some Covid woes, and in an attempt to self-sooth and assess my personal risk I decided to indulge in some dark humor centered on the question, “Am I more likely to die of Covid or …?” What emerged was a March Madness-inspired infographic pitting the top 10 causes of death in America against one another for the title of #1 Killer. Of note, this was my first experience using Illustrator. Oh, and all those silly graphics? Yeah, I drew them. They won't win awards, but I am pleased with them.</p><p>The PDF gives a quick look. Downloading the png gives the full experience.</p>"
  },
  {
    "title": "Union Cycliste Iternational - 2024 Eastern Europe",
    "type": "Cartography",
    "imageSrc": "images/TjBruhn_Racemap.png",
    "altText": "Bicycle stage race map",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/TjBruhn_Racemap.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>This is an overview map of an imaginary bicycle stage race. This project began just as Russia invaded Ukraine. I had the choice of where in the world to set my imaginary race, and I decided I would use the opportunity to learn more about the region.</p><p>I developed the custom shaded relief with custom colored/textured landcover. I was also playing around with flow maps and using lines to communicate direction and magnitude. Finally, I was striving for clean visual hierarchy in an information-dense map.</p>"
  },
  {
    "title": "Site Selection - Recreation Development",
    "type": "GIS Analysis",
    "imageSrc": "images/Bruhn_SiteSelectRecDev.png",
    "altText": "site selection - recreation map",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/Bruhn_SiteSelectRecDev.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>Does it ever seem like you are surrounded by wild land and yet there are so few trails? This question for Eugene, Oregon prompted this project. Eugene is known as a recreation community, yet there are not a lot of trails close to town. Eugene is a geographic oddity. It is within a 2-hour drive from any landscape one could want! But that means it also is a 2-hour drive to get to anything. Longing for more after-work trails, I set out to identify more areas for trail development close to Eugene. This was my term project for my first GIS course and shows the results of that analysis. At the time I had less than 4 weeks experience in ArcMap. In hindsight, taking on that level of analysis with so little experience was pretty bold. And sadly, no, there have not been any new trails developed as a result of my project. Perhaps it just hasn't landed in the right hands yet?</p>"
  },
  {
    "title": "Site Selection - Songer Dream Cabin",
    "type": "GIS Analysis",
    "imageSrc": "images/Bruhn_SiteSelectDreamCabin.png",
    "altText": "site selection - cabin location map",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/Bruhn_SiteSelectDreamCabin.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>Who doesn't want a dream cabin in the mountains? This was my second GIS term project where I was challenged to find a location for my instructor's dream cabin. Provided a relatively specific set of must-haves and an interest in figuring out ArcMap's Model Builder, I set after the task of narrowing the possibilities. The model worked beautifully, and I think the sites would be nice too.</p>"
  },
  {
    "title": "SAP Emergency Access",
    "type": "Data Collection",
    "imageSrc": "images/Bruhn_SAP_EMS_Access.png",
    "altText": "Emergency access map",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/Bruhn_SAP_EMS_Access.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>This map of little-known Suzanne Arlie Park just southwest of Eugene was my third GIS term project and was created for Goshen Fire District. I had just started as an intern at Goshen and the GIS team was in a mad rush to get a wildland EMS access map created for well-known Mt. Pisgah. Goshen mentioned that there were other parks in their district that needed access maps. I needed a term project, so why not? This area is composed of unofficial social trails that no one had mapped for emergency response. I set up an ArcCollector map and set out to collect and categorize all the trails in the area. Visually, I don't love this one. I was directed to make it match the Mt. Pisgah map and this was the symbology that was chosen for it. Despite my dislike for the aesthetic, the firefighters appreciate it and find it very functional. Still I'm itching for a redo…</p>"
  },
  {
    "title": "Dispatch Planning",
    "type": "GIS Analysis",
    "imageSrc": "images/Bruhn_PHGFD_Dispatch.png",
    "altText": "dispatch planning map selection",
    "buttons": [
      {
        "btnName": "District PDF",
        "link": "lib/Bruhn_PHGFD_Dispatch.pdf",
        "action": "target='_blank'"
      },
      {
        "btnName": "Series PDF",
        "link": "lib/Bruhn_PHGFD_dispatchSeries.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>Goshen Fire was interested in having their 911 dispatch maps revised to help improve the way units were dispatched to areas in the district based on criteria outlined by the Chief. This turned out to be an extensive project with much analysis and many maps along the way.</p><p>It started with a massive district-wide map, dense with features and designed for a meeting in which the fire chiefs would physically draw out boundaries and areas with unique dispatch needs.</p><p>I was then asked to identify all the areas with addresses within 1000 road feet (including driveways) of a fire hydrant. I built a network dataset, used the network analyst toolset, and  developed a series of hydranted area maps for Chief's approval.</p><p>Having gathered all this input, I went through and recreated the dispatch boundaries. I prepared another large district wide map as well as an indexed map series showing the redrawn dispatch zones.</p>"
  },
  {
    "title": "Heceta Flight Plan",
    "type": "UAS Flight Planning",
    "imageSrc": "images/Bruhn_Heceta_Flightplan.png",
    "altText": "flight plan map",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/Bruhn_Heceta_Flightplan.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>I was part of a team working with the US Forest Service to produce an orthographic map of the dunes just north of Florence, OR. The map would be used to identify clusters of invasive Scotch Broom for treatment. Navigating coastal dunes can be very disorienting. Five flight teams on simultaneous flights at similar altitudes requires good situational awareness. After receiving the mission brief with a rough sketch on a small-scale map, I created this overview map and a series of larger scale zone maps as georeferenced PDFs. The flight teams used these maps in Avenza Maps to navigate the dunes with increased situational awareness provided by a live track of their position in the mission area.</p>"
  },
  {
    "title": "Amazon Park - Ortho",
    "type": "UAS Ortho Cartography",
    "imageSrc": "images/Bruhn_Amazon_Ortho.png",
    "altText": "amazon park map",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/Bruhn_Amazon_Ortho.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>What does one do when they get a brand new UAS? Make a map of course! Having just received my brand new Autel Evo II Pro and gone through some test flights it was time to see what this thing could do. I went out to a nearby park, created a flight plan, and set my new tool to do its work. I brought it home and processed the ortho in Agisoft Metashape and was thoroughly pleased with the results.</p><p>Up to this point all my GIS experience was in ArcMap. I decided that, seeing as I was playing with new things, I would also give    ArcPro a go. I loaded up a new project and dropped in the ortho. I created a couple of new feature classes and digitized the fields and the paths. I moved on to the layout and ended up with a passable first foray in ArcPro.</p><p>Do you love those incredibly precise acreage values? Don't worry, I have since learned how to display more meaningful    values. But hey, some flaws are worth keeping to remind us of our progress.</p>"
  },
  {
    "title": "Lane Community College - Ortho",
    "type": "UAS Ortho",
    "imageSrc": "images/Bruhn_LCC_Ortho.png",
    "altText": "orthographic map of lane community college",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/Bruhn_LCC_Ortho.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>With a ground sample distance of about 1 inch, this orthographic map of Lane Community College has found many uses. A beautiful cloudless day created excellent flight conditions, a well-lit map, and a sunburn on my arms from holding the aircraft controller. I collected these images as the pilot in command with two visual observers. The images were acquired with Autel Evo II Pro aircraft. The ground control points were collected with an Emlid Reach2. I processed the ortho in Pix4d mapper. It serves as a base map for Goshen Fire's preplanning maps of campus, and it has assisted campus planning in several projects. Note: this version is a large PDF with less resolution that the original.</p>"
  },
  {
    "title": "Schools (my first map)",
    "type": "Cartography",
    "imageSrc": "images/Bruhn_Schools_1stMap.png",
    "altText": "map of schools",
    "buttons": [
      {
        "btnName": "View PDF",
        "link": "lib/Bruhn_Schools_1stMap.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>Do you remember your first? A time-honored question we use to reflect on everything that becomes important in our lives. This is my first map using GIS software. It has that iconic ArcMap feel that is nostalgic of the maps you would find in old textbooks. Sigh. Honestly, I am pretty proud of this this one. As first maps go, I think this is a winner.</p>"
  },
  {
    "title": "Proposed Boundaries",
    "type": "GIS Analysis",
    "imageSrc": "images/Bruhn_newBoundary_plss_3.22.22.png",
    "altText": "proposed boundary map",
    "buttons": [
      {
        "btnName": "Townhall PDF",
        "link": "lib/Bruhn_TownHall_Potential_Newlands.pdf",
        "action": "target='_blank'"
      },
      {
        "btnName": "Board PDF",
        "link": "lib/Bruhn_newBoundary_plss_3.22.22.pdf",
        "action": "target='_blank'"
      }
    ],
    "description": "<p>Just around the boundaries of nearly every fire district in Oregon there are homes that fall outside the district and are therefore not protected in the case of a fire. Goshen Fire asked me to undertake a project to identify such properties in their adjacent areas. I combed through parcel and address data to identify unprotected sites. I explored access and potential response times. I calculated the potential revenue that would result from extending protection to these homes. Once the potential annexation sites were identified I went through a process to draw new proposed boundaries for the district. I drew several iterations of boundaries, each using a different reference layer to snap to. The version that stuck was a combination of PLSS boundaries and parcel boundaries. This large map was prepared for a town hall-style meeting for residents to explore the proposed new boundaries. The small map was designed for the Board of Directors and was accompanied by a series of large scale maps detailing each of the annexation clusters.</p>"
  }
]